app/views/main/home.html.erb

SELECT `cuenta_bancas`.* FROM `cuenta_bancas`
---
<div class="criptos">
    <% @cuentas = CuentaBanca.all %>