app/views/cuenta_bancas/index.html.erb

<div class="criptos">
    <% @cuentas = CuentaBanca.all %>
---
SELECT `cuenta_bancas`.* FROM `cuenta_bancas`