app/controllers/api/v1/cuenta_bancas_controller.rb

  def show
        @cuenta_banca = CuentaBanca.where(user_id: params[:id])
---
SELECT `cuenta_bancas`.* FROM `cuenta_bancas` WHERE `cuenta_bancas`.`user_id` = 1

  def showID
    @cuenta_banca = CuentaBanca.where(user_id: params[:id], id: params[:user_id])
---
SELECT `cuenta_bancas`.* FROM `cuenta_bancas` WHERE `cuenta_bancas`.`user_id` = 1 AND `cuenta_bancas`.`id` = 12

  def showSoloID
    @cuenta_banca = CuentaBanca.where(user_id: params[:id], id: params[:user_id])
---
SELECT `cuenta_bancas`.* FROM `cuenta_bancas` WHERE `cuenta_bancas`.`user_id` = 1

  def index
          render json: CuentaBanca.where(user_id: current_user.id), status: :ok
---
SELECT `cuenta_bancas`.* FROM `cuenta_bancas` WHERE `cuenta_bancas`.`user_id` = 1

  def update
   @cuenta_banca = CuentaBanca.find(params[:id])
---
SELECT `cuenta_bancas`.* FROM `cuenta_bancas` WHERE `cuenta_bancas`.`id` = 1 LIMIT 1

  def create
      @cuenta_banca = CuentaBanca.new(cuenta_banca_params)

        if @cuenta_banca.save
---
INSERT INTO `cuenta_bancas` (`user_id`, `numeroCuenta`, `saldo`, `tipo`, `comision`, `divisa`, `created_at`, `updated_at`) VALUES (1, 'ES98 6656 0079', 0.0, 'plata', 0.05, '€', '2022-06-09 00:08:47.705811', '2022-06-09 00:08:47.705811')