app/controllers/api/v1/users_controller.rb

      def show
            @user = User.find_by(id: params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

      def index
              render json: User.all, status: :ok
---
SELECT `users`.* FROM `users`