app/controllers/cuenta_bancas_controller.rb

  def index
    @cuenta_bancas = CuentaBanca.where(user_id:  params[:id])
---
SELECT `cuenta_bancas`.* FROM `cuenta_bancas` WHERE `cuenta_bancas`.`user_id` = 1 ORDER BY `cuenta_bancas`.`id` ASC LIMIT 1

  def create
    @cuenta_banca = CuentaBanca.new(cuenta_banca_params)

    respond_to do |format|
      if @cuenta_banca.save
---
INSERT INTO `cuenta_bancas` (`user_id`, `numeroCuenta`, `saldo`, `tipo`, `comision`, `divisa`, `created_at`, `updated_at`) VALUES (1, 'dfg', 'dfg', 'df', 'ddfg', 'fgf', '2022-06-09 08:51:50.545191', '2022-06-09 08:51:50.545191')

    def set_cuenta_banca
      @cuenta_banca = CuentaBanca.find(params[:id])
---
SELECT `cuenta_bancas`.* FROM `cuenta_bancas` WHERE `cuenta_bancas`.`id` = 25 LIMIT 1