app/controllers/cuenta_bancas_controller.rb

  def index
    @cuenta_bancas = CuentaBanca.all
---
SELECT `cuenta_bancas`.* FROM `cuenta_bancas`