app/views/cripto/criptoVista.html.erb

SELECT `wallet_criptos`.* FROM `wallet_criptos`
---
<div id="criptos">
    <% @wallet_cripto = WalletCripto.all %>